app/controllers/incidents_controller.rb

SELECT count(*) AS count_all FROM `police_reports`
---
  def index
    if params[:lat] && params[:lng]
      @origin = [params[:lat], params[:lng]]
    elsif params[:address]
      @origin = params[:address]
      @origin += ', Seattle, WA' unless @origin.downcase.match('seattle')
    else
      @origin = 'Seattle, WA'
    end

    @incidents = PoliceReport.newest.find(:all, :origin => @origin,
      :within => params[:d] || 2, :limit => 4,
      :order => 'distance ASC, reporteddate DESC')

    if @incidents.length < 4